## Data Manipulation with Pandas

In this lab, you will learn how to manipulate data with Pandas. Here is an overview:

### 1. Basics of Pandas for data manipulation:

A. Series and DataFrames<br>
B. Data Indexing and Selection, and Iteration<br>
C. Data Wrangling<br>
D. Dealing with Missing data<br>
E. Basic operations and Functions<br>
F. Aggregation Methods<br>
G. Groupby<br>
H. CrossTab<br>
I. Merging, Joining and Concatenate<br>
J. Beyond Dataframes: Working with CSV, and Excel<br>

### 2. Real World Exploratory Data Analysis (EDA)<br>

## 1. Basics of Pandas for data manipulation

### A. Series and DataFrames
* Both series and DataFrames are Pandas Data structures.

* Series is like one dimensional NumPy array with axis labels.

* DataFrame is multidimensional NumPy array with labels on rows and columns.

Working with NumPy, we saw that it supports numeric type data. Pandas on other hand supports whole range of data types, from numeric to strings, etc..

Since we are using python notebook, we do not need to install Pandas. We only just have to import it.
 
     import pandas as pd

In [278]:
# importing numpy and pandas

import numpy as np
import pandas as pd

#### Creating series

* Series can be created from a python list, dictionary, and NumPy array.

In [2]:
# Creating the series from a python list

num_list = [1,2,3,4,5]

pd.Series(num_list)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
week_days = ['Mon', 'Tues', 'Wed', 'Thur', 'Fri']

pd.Series(week_days, index=["a", "b", "c", "d", "e"])

a     Mon
b    Tues
c     Wed
d    Thur
e     Fri
dtype: object

Note the data types `int64` and `object`

In [4]:
# creating the series from the dictionary

countries_code = { 1:"United Stated",
                 91:"India",
                 49:"Germany",
                 86:"China",
                 250:"Rwanda"}

pd.Series(countries_code)

1      United Stated
91             India
49           Germany
86             China
250           Rwanda
dtype: object

In [5]:
population_dict = {'California': 38332521,
                  'Texas': 26448193,
                  'New York': 19651127,
                  'Florida': 19552860,
                  'Illinois': 12882135}

population = pd.Series(population_dict)
population

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [6]:
d = {1:'a', 2:'b', 3:'c', 4:'d'}
pd.Series(d)

1    a
2    b
3    c
4    d
dtype: object

In [7]:
# Creating the series from NumPy array
# We provide the list of indexes
# If we don't provide the indexes, the default indexes are numbers... starts from 0,1,2..

arr = np.array ([1, 2, 3, 4, 5])
pd.Series(arr)

0    1
1    2
2    3
3    4
4    5
dtype: int32

In [8]:
pd.Series(arr, index=['a', 'b', 'c', 'd', 'e'])

a    1
b    2
c    3
d    4
e    5
dtype: int32

#### Creating DataFrames
DataFrames are the most used pandas data structure, it can be created from a dictionary, 2D array, and Series.

In [9]:
# Creating DataFrames from a dictionary

countries = {'Name': ['USA', 'India', 'Germany', 'Rwanda'],
            'Codes': [1, 91, 49, 250]}

pd.DataFrame(countries)

      Name  Codes
0      USA      1
1    India     91
2  Germany     49
3   Rwanda    250

In [10]:
# Creating DataFrames from a 2D array
# You pass the list of columns

array_2D = np.array([[1,2,3], [4,5,6], [7,8,9]])

pd.DataFrame(array_2D, columns = ['column 1', 'column 2', 'column3'])

   column 1  column 2  column3
0         1         2        3
1         4         5        6
2         7         8        9

In [11]:
# Creating DataFrames from pandas Series
# pass the columns in a list


countries_code = {"United Stated":1,
                 "India":91,
                 "Germany":49,
                 "China":86,
                 "Rwanda":250}

pd_series = pd.Series(countries_code)

df = pd.DataFrame(pd_series, columns = ['codes'])
df

               codes
United Stated      1
India             91
Germany           49
China             86
Rwanda           250

In [12]:
# Adding a column
# Number in population are pretty random

df['population'] = [100, 450, 575, 5885, 533]

df

               codes  population
United Stated      1         100
India             91         450
Germany           49         575
China             86        5885
Rwanda           250         533

In [13]:
# Removing a column

df.drop('population', axis =1)

               codes
United Stated      1
India             91
Germany           49
China             86
Rwanda           250

In [14]:
df.columns

Index(['codes', 'population'], dtype='object')

In [15]:
df.keys

<bound method NDFrame.keys of                codes  population
United Stated      1         100
India             91         450
Germany           49         575
China             86        5885
Rwanda           250         533>

In [16]:
df.index

Index(['United Stated', 'India', 'Germany', 'China', 'Rwanda'], dtype='object')

### B. Data Indexing and Selection, and Iteration

Indexing and Selection works in both Series and DataFrame.

Because DataFrame is made of series, let's focus on how to select data in DataFrame.

In [17]:
# Creating DataFrame from a dictionary

countries = {'Name': ['USA', 'India', 'Germany', 'Rwanda'],
            'Codes': [1, 91, 49, 250]}

df = pd.DataFrame(countries, index=['a', 'b', 'c', 'd'])
df

      Name  Codes
a      USA      1
b    India     91
c  Germany     49
d   Rwanda    250

In [18]:
df['Name']

a        USA
b      India
c    Germany
d     Rwanda
Name: Name, dtype: object

In [19]:
df.Name

a        USA
b      India
c    Germany
d     Rwanda
Name: Name, dtype: object

In [20]:
df['Codes']

a      1
b     91
c     49
d    250
Name: Codes, dtype: int64

In [21]:
df.Codes

a      1
b     91
c     49
d    250
Name: Codes, dtype: int64

In [22]:
## When you have many columns, columns in list will be selected

df[['Name', 'Codes']]

      Name  Codes
a      USA      1
b    India     91
c  Germany     49
d   Rwanda    250

In [23]:
# This will return the first two rows
df[0:2]

    Name  Codes
a    USA      1
b  India     91

you can also use `loc` to select data by the label indexes and `iloc` to select by default integer index(or by the position of the row)

In [24]:
df.loc['a']

Name     USA
Codes      1
Name: a, dtype: object

In [25]:
df.loc['b':'d']

      Name  Codes
b    India     91
c  Germany     49
d   Rwanda    250

In [26]:
df[:'b']

    Name  Codes
a    USA      1
b  India     91

In [27]:
df.iloc[2]

Name     Germany
Codes         49
Name: c, dtype: object

In [28]:
df.iloc[1:3]

      Name  Codes
b    India     91
c  Germany     49

In [29]:
df.iloc[2:]

      Name  Codes
c  Germany     49
d   Rwanda    250

### Condtional Selection

In [30]:
df

      Name  Codes
a      USA      1
b    India     91
c  Germany     49
d   Rwanda    250

In [31]:
# let's select a country with code 49

df[df['Codes'] == 49]

      Name  Codes
c  Germany     49

In [32]:
df[df['Codes'] < 250 ]

      Name  Codes
a      USA      1
b    India     91
c  Germany     49

In [33]:
df[df['Name'] == 'USA']

  Name  Codes
a  USA      1

In [34]:
# you can use and (&) or (|) for more than conditions
# df [(condition 1) & (condition 2)]

df[(df['Codes'] == 91) & (df['Name'] == 'India')]

    Name  Codes
b  India     91

You can also use `isin()` and `where()` to select data in a series or dataframe.

In [35]:
# isin() return false or true when provided value is included in dataframe

sample_codes_names=[1,3,250, 'USA', 'India', 'England']

df.isin(sample_codes_names)

    Name  Codes
a   True   True
b   True  False
c  False  False
d  False   True

As you can see, it returned `True` wherever a country code or name is found. Otherwise, `False`. you can use a dictionary to match search by columns. A key must be a column and values are passed in list.

In [36]:
sample_codes_names={'Codes':[1,3,250], 'Name':['USA', 'India', 'England']}

df.isin(sample_codes_names)

    Name  Codes
a   True   True
b   True  False
c  False  False
d  False   True

In [37]:
df[df['Name'].isin(['India'])]

    Name  Codes
b  India     91

### Exercise 1: DataFrame Creation & Data Selection in Pandas

Consider the following dictionary which is relating the are in square units of some USA states:

area_dict = {'california': 425636, 'Texas':676732, 'New York':147819, 'Florida':290921, 'Illinois':149234}

1. Create a Series using the given dictionary<br>
2. Convert the pandas series to a dataframe<br>
3. Extract areas for 'Texas', 'New York, and 'Florida' from the created dataframe

In [158]:
area_dict = {'california': 425636, 
             'Texas':676732, 
             'New York':147819, 
             'Florida':290921, 
             'Illinois':149234}

areaDict=pd.Series(area_dict)
areaDict

california    425636
Texas         676732
New York      147819
Florida       290921
Illinois      149234
dtype: int64

In [160]:
df.iloc[1:4]

          Sq units
Texas       676732
New York    147819
Florida     290921

In [161]:
df.loc['Texas':'Florida']

          Sq units
Texas       676732
New York    147819
Florida     290921

### Assignment: Data Selection in DataFrame


The two dictionaries below represent the area and population of states in the USA respectively

{'California': 423967, 'Texas': 695662,'New York': 141297, 'Florida': 170312,'Illinois': 149995} 
{'California': 38332521, 'Texas': 26448193,'New York': 19651127, 'Florida': 19552860,'Illinois': 12882135}

* Create a data frame with two columns named area and pop using the dictionaries given below
* Access(Grab) the 'area' column of the data DataFrame
* Add a new column called density to your DataFrame by dividing pop column by area column

In [164]:
Area ={'California': 423967, 'Texas': 695662,'New York': 141297, 'Florida': 170312,'Illinois': 149995} 
Population= {'California': 38332521, 'Texas': 26448193,'New York': 19651127, 'Florida': 19552860,'Illinois': 12882135}

In [165]:
Area=pd.Series(Area)
Area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
dtype: int64

In [166]:
Population=pd.Series(Population)
Population

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [167]:
# Create a data frame with two columns named area and pop using the dictionaries given below

States = {'States': ['California', 'Texas', 'New York', 'Florida', 'Illinois'],
           'Area':[423967,695662,141297,170312,149995],
         'Pop':[38332521,26448193,19651127,19552860,12882135]}
df = pd.DataFrame(States)
df

       States    Area       Pop
0  California  423967  38332521
1       Texas  695662  26448193
2    New York  141297  19651127
3     Florida  170312  19552860
4    Illinois  149995  12882135

In [168]:
# Access(Grab) the 'area' column of the data DataFrame

df[['Area']]

     Area
0  423967
1  695662
2  141297
3  170312
4  149995

In [169]:
df[['Pop']]

        Pop
0  38332521
1  26448193
2  19651127
3  19552860
4  12882135

In [170]:
# Add a new column called density to your DataFrame by dividing pop column by area column

# Density == POP / AREA


Density = [38332521 / 423967, 26448193 / 695662, 19651127 / 141297, 19552860 / 170312, 12882135 / 149995]
Density

[90.41392608386974,
 38.01874042279153,
 139.07674614464568,
 114.80612053173,
 85.88376279209307]

In [171]:
# Add a new column called density to your DataFrame by dividing pop column by area column

# Density == POP / AREA

df.insert(3,'Density',[90.41392608386974,
 38.01874042279153,
 139.07674614464568,
 114.80612053173,
 85.88376279209307])
df

       States    Area       Pop     Density
0  California  423967  38332521   90.413926
1       Texas  695662  26448193   38.018740
2    New York  141297  19651127  139.076746
3     Florida  170312  19552860  114.806121
4    Illinois  149995  12882135   85.883763

In [172]:
df2 = pd.DataFrame(np.array([[1,2,3], [4,5,6], [7,8,9]]),
                  columns = ['columns 1', 'columns 2', 'columns 3'])
df2

   columns 1  columns 2  columns 3
0          1          2          3
1          4          5          6
2          7          8          9

In [173]:
df2.isin([0,3,4,5,7])

   columns 1  columns 2  columns 3
0      False      False       True
1       True       True      False
2       True      False      False

In [174]:
df2[df2 > 4]

   columns 1  columns 2  columns 3
0        NaN        NaN        NaN
1        NaN        5.0        6.0
2        7.0        8.0        9.0

`where` allows you to replace the value that doesnt meet the provided condition with any other value. So, if we do `df2.where(df2 > 4, 0)`  as follows, all values less than `4` will be replaced by `0`.

In [175]:
df2.where(df2 > 4, 0)

   columns 1  columns 2  columns 3
0          0          0          0
1          0          5          6
2          7          8          9

Similarly, we can achieve the above by...

In [45]:
df2[df2 <= 4] = 0
df2

   column 1  column 2  column3
0         0         0        0
1         0         5        6
2         7         8        9

### Iteration
...

    df.items() #iterate over(column name, Series) pairs.
    df.iteritems() Iterate over (column name, Series) pairs.
    DataFrame.Iterrows() Iterate over DataFrame rows as (index, Series) pairs.
    DataFrame.itertuples([Index, name]) Iterate over DataFrame rows as namedtuples.
...

In [46]:
# Iterate over (column name, Series) pairs.

for col_name, content in df2.items():
    print(col_name)
    print(content)

column 1
0    0
1    0
2    7
Name: column 1, dtype: int32
column 2
0    0
1    5
2    8
Name: column 2, dtype: int32
column3
0    0
1    6
2    9
Name: column3, dtype: int32

In [47]:
# Iterate over (column name, Series) pairs.
# same as df.items()

for col_name, content in df2.iteritems():
    print(col_name)
    print(content)

column 1
0    0
1    0
2    7
Name: column 1, dtype: int32
column 2
0    0
1    5
2    8
Name: column 2, dtype: int32
column3
0    0
1    6
2    9
Name: column3, dtype: int32

In [48]:
# Iterate over DataFrame rows as (index, Series)  pairs

for row in df2.iterrows():
    print(row)

(0, column 1    0
column 2    0
column3     0
Name: 0, dtype: int32)
(1, column 1    0
column 2    5
column3     6
Name: 1, dtype: int32)
(2, column 1    7
column 2    8
column3     9
Name: 2, dtype: int32)

In [49]:
# Iterate over DataFrame rows as namedtuples

for row in df2.itertuples():
    print(row)

Pandas(Index=0, _1=0, _2=0, column3=0)
Pandas(Index=1, _1=0, _2=5, column3=6)
Pandas(Index=2, _1=7, _2=8, column3=9)

#### C. Data Wrangling

The difference between data found in many tutorials and data from the real world is that real-world data is rarely clean and homogeneous. In particular, many interesting datasets will have some amount of data missing. To make matters even more complicated, different data sources may indicate missing data in different ways.

In this way, we need to define methods that allow us to structure, clean and enrich the data acquired from the real world, which are the main steps for Data Wrangling. Before continuing, let's see what is the difference between these three steps and expand their definition:

> #### 1. Data structuring:

The first step in the data wrangling process is to separate the relevant data into multiple columns, so that the analysis can be run grouping by common values in a separate way. In turn, if there are columns that are not desired or that will not be relevant to the analysis, this is the phase to filter the data or mix together some of their columns.

> #### 2. Data Cleaning

In this step, the data is cleaned up for high-quality analysis. Null values are handled, and the data format is standardized. We will enter this process in the following weeks.

> #### 3. Data Enriching

After cleaning, the data is enriched by increasing some variables in what is known as Data Augmentation and using additional sources to enrich them for the following stages of processing.

For now, we will review how to handle missing values, a fundamental step for data cleaning.

### D. Dealing with missing Data

Real world datasets are messy, often with missing values. Pandas replace NaN with missing values by default. NaN stands for not a number.

Missing values can either be ignored, dropped or filled.

In [50]:
# Creating a dataframe

df3 = pd.DataFrame(np.array([[1,2,3], [4,np.nan,6], [7,np.nan,np.nan]]), columns = ['column 1', 'column 2', 'column 3'])
df3

   column 1  column 2  column 3
0       1.0       2.0       3.0
1       4.0       NaN       6.0
2       7.0       NaN       NaN

#### Checking Missing Value

In [51]:
# Recognizing the missing values

df3.isnull()

   column 1  column 2  column 3
0     False     False     False
1     False      True     False
2     False      True      True

In [52]:
# Calculating number of the missing values in each feature

df3.isnull().sum()

column 1    0
column 2    2
column 3    1
dtype: int64

In [53]:
# Recognizing non missing values

df3.notna()

   column 1  column 2  column 3
0      True      True      True
1      True     False      True
2      True     False     False

In [54]:
df3.notna().sum()

column 1    3
column 2    1
column 3    2
dtype: int64

#### Removing the missing values

In [55]:
# Dropping missing values

df3.dropna()

   column 1  column 2  column 3
0       1.0       2.0       3.0

All rows are deleted becuase `dropna()` will remove each row which has a missing  value

In [56]:
# you can drop NaNs in specific columns(s)

df3['column 3'].dropna()

0    3.0
1    6.0
Name: column 3, dtype: float64

In [57]:
# you can drop data by axis
# Axis = 1... drop all columns wit Nans
# df3.dropna(axis='columns')

df3.dropna(axis=1)

   column 1
0       1.0
1       4.0
2       7.0

In [58]:
# axis = 0... drop all rows with Nans
# df3.dropna(axis='rows') is same

df3.dropna(axis=0)

   column 1  column 2  column 3
0       1.0       2.0       3.0

#### Filling the missing values

In [59]:
# Filling the missing values

df3.fillna(10)

   column 1  column 2  column 3
0       1.0       2.0       3.0
1       4.0      10.0       6.0
2       7.0      10.0      10.0

In [60]:
df3.fillna('fillme')

   column 1 column 2 column 3
0       1.0      2.0      3.0
1       4.0   fillme      6.0
2       7.0   fillme   fillme

In [61]:
# You can forward fill (ffill) or backward fill (bfill)
# or fill a current value with previous or next value

df3.fillna(method='ffill')

   column 1  column 2  column 3
0       1.0       2.0       3.0
1       4.0       2.0       6.0
2       7.0       2.0       6.0

In [62]:
# It won't change it because the last values are NaNs, so it backward it

df3.fillna(method='bfill')

   column 1  column 2  column 3
0       1.0       2.0       3.0
1       4.0       NaN       6.0
2       7.0       NaN       NaN

In [63]:
# If we change the axis to columns, you can see that Nans at row 2 and col 2 is backfilled with 6

df3.fillna(method='bfill', axis='columns')

   column 1  column 2  column 3
0       1.0       2.0       3.0
1       4.0       6.0       6.0
2       7.0       NaN       NaN

### E. More Operations and Functions

This section will show the more and most useful fucntions in Pandas.

In [64]:
df4 = pd.DataFrame({
    'Product Name':['Shirt','Boot','Bag','Blouse','Sneakers','Hat','Singlet','Phone','Television','Shirt'],
    'Order Number':[45,56,64,67,89,40,33,49,98,7],
    'Total Quantity':[10,5,9,4,3,3,2,6,1,18]})
df4

  Product Name  Order Number  Total Quantity
0        Shirt            45              10
1         Boot            56               5
2          Bag            64               9
3       Blouse            67               4
4     Sneakers            89               3
5          Hat            40               3
6      Singlet            33               2
7        Phone            49               6
8   Television            98               1
9        Shirt             7              18

#### Retrieving basic info about the DataFrame

In [65]:
# Return a summary about the dataframe

df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Product Name    10 non-null     object
 1   Order Number    10 non-null     int64
 2   Total Quantity  10 non-null     int64
dtypes: int64(2), object(1)
memory usage: 368.0+ bytes

In [66]:
# Return dataframe columns

df4.columns

Index(['Product Name', 'Order Number', 'Total Quantity'], dtype='object')

In [67]:
# return dataframe datadf4

df4.keys

<bound method NDFrame.keys of   Product Name  Order Number  Total Quantity
0        Shirt            45              10
1         Boot            56               5
2          Bag            64               9
3       Blouse            67               4
4     Sneakers            89               3
5          Hat            40               3
6      Singlet            33               2
7        Phone            49               6
8   Television            98               1
9        Shirt             7              18>

In [68]:
# Return the head of the dataframe
# choose how many rows you want in head()

df4.head()

  Product Name  Order Number  Total Quantity
0        Shirt            45              10
1         Boot            56               5
2          Bag            64               9
3       Blouse            67               4
4     Sneakers            89               3

In [69]:
# return the tail of the dataframe

df4.tail()

  Product Name  Order Number  Total Quantity
5          Hat            40               3
6      Singlet            33               2
7        Phone            49               6
8   Television            98               1
9        Shirt             7              18

In [70]:
# Return NumPy array of the dataframe

df4.values

array([['Shirt', 45, 10],
       ['Boot', 56, 5],
       ['Bag', 64, 9],
       ['Blouse', 67, 4],
       ['Sneakers', 89, 3],
       ['Hat', 40, 3],
       ['Singlet', 33, 2],
       ['Phone', 49, 6],
       ['Television', 98, 1],
       ['Shirt', 7, 18]], dtype=object)

In [71]:
# return the shape

df4.shape

(10, 3)

In [72]:
# Return the lenght of the dataframe /the number of rows in a dataframe

df4.shape[0]

10

In [73]:
# Return the lenght of the dataframe /the number of columns in a dataframe

df4.shape[1]

3

In [74]:
# Return the size of number of elemnts in a dataframe

df4.size

30

#### Unique values

In [75]:
# Return Unique values in a given columns

df4['Product Name'].unique()

array(['Shirt', 'Boot', 'Bag', 'Blouse', 'Sneakers', 'Hat', 'Singlet',
       'Phone', 'Television'], dtype=object)

In [76]:
# Return a number of Unique values

df4['Product Name'].nunique()

9

In [77]:
# Counting the occurence of eavh value in a coulumn

df4['Product Name'].value_counts()

Shirt         2
Boot          1
Bag           1
Blouse        1
Sneakers      1
Hat           1
Singlet       1
Phone         1
Television    1
Name: Product Name, dtype: int64

#### Applying a function to DataFrame

In [78]:
# Double the quantity product

def double_quantity(x):
    return x * x

In [79]:
df4['Total Quantity'].apply(double_quantity)

0    100
1     25
2     81
3     16
4      9
5      9
6      4
7     36
8      1
9    324
Name: Total Quantity, dtype: int64

In [80]:
# You can also apply an anonymous function to a dataframe
# Squaring each value in dataframe

df5 = pd.DataFrame([[1,2], [4,5]], columns=['col1', 'col2'])

df5

   col1  col2
0     1     2
1     4     5

In [81]:
df5.applymap(lambda x: x**2)

   col1  col2
0     1     4
1    16    25

### Sorting values in dataframe

In [82]:
df4

  Product Name  Order Number  Total Quantity
0        Shirt            45              10
1         Boot            56               5
2          Bag            64               9
3       Blouse            67               4
4     Sneakers            89               3
5          Hat            40               3
6      Singlet            33               2
7        Phone            49               6
8   Television            98               1
9        Shirt             7              18

In [83]:
# sort the df4 by the order number

df4.sort_values(['Order Number'])

  Product Name  Order Number  Total Quantity
9        Shirt             7              18
6      Singlet            33               2
5          Hat            40               3
0        Shirt            45              10
7        Phone            49               6
1         Boot            56               5
2          Bag            64               9
3       Blouse            67               4
4     Sneakers            89               3
8   Television            98               1

In [84]:
df4.sort_values (['Order Number'], ascending=False)

  Product Name  Order Number  Total Quantity
8   Television            98               1
4     Sneakers            89               3
3       Blouse            67               4
2          Bag            64               9
1         Boot            56               5
7        Phone            49               6
0        Shirt            45              10
5          Hat            40               3
6      Singlet            33               2
9        Shirt             7              18

### F. Aggregation methods

In [85]:
df4

  Product Name  Order Number  Total Quantity
0        Shirt            45              10
1         Boot            56               5
2          Bag            64               9
3       Blouse            67               4
4     Sneakers            89               3
5          Hat            40               3
6      Singlet            33               2
7        Phone            49               6
8   Television            98               1
9        Shirt             7              18

In [86]:
# summary statistics

df4.describe()

       Order Number  Total Quantity
count     10.000000       10.000000
mean      54.800000        6.100000
std       26.624133        5.087021
min        7.000000        1.000000
25%       41.250000        3.000000
50%       52.500000        4.500000
75%       66.250000        8.250000
max       98.000000       18.000000

In [87]:
# Summary Statistics of the non-numeric column

df4.describe(include='O').T

             count unique    top freq
Product Name    10      9  Shirt    2

In [88]:
df4.describe().transpose()

                count  mean        std  min    25%   50%    75%   max
Order Number     10.0  54.8  26.624133  7.0  41.25  52.5  66.25  98.0
Total Quantity   10.0   6.1   5.087021  1.0   3.00   4.5   8.25  18.0

In [89]:
# Mode of the dataframe
# Mode is the most recurring values

df4['Total Quantity'].mode()

0    3
Name: Total Quantity, dtype: int64

In [90]:
# The Maximum Value

df4['Total Quantity'].max()

18

In [91]:
# The minimum value

df4['Total Quantity'].min()

1

In [92]:
# The Mean

df4['Total Quantity'].mean()

6.1

In [93]:
# The Median value in the dataframe

df4['Total Quantity'].median()

4.5

In [94]:
# Standard deviation

df4['Total Quantity'].std()

5.087020520675908

In [95]:
# variance

df4['Total Quantity'].var()

25.87777777777778

In [96]:
# Sum of all values in a column

df4['Total Quantity'].sum()

61

In [97]:
# Product of all values in dataframe

df4['Total Quantity'].prod()

3499200

### G. Groupby

`Group by` involves splitting data into groups, applying function to each group, and combining the results.

In [98]:
df6 = pd.DataFrame({'Product Name': ['Shirt', 'Boot', 'Bag','Ankle' ,'Pullover','Boot','Ankle', 'Tshirt', 'Shirt'],
            'Order Number':[45,56,64,34,67,56,34,89,45],
            'Total Quantity':[10,5,9,11,11,8,14,23,10]})
columns= ['Product Name', 'Order Number', 'Total Quantity']

In [99]:
df6

  Product Name  Order Number  Total Quantity
0        Shirt            45              10
1         Boot            56               5
2          Bag            64               9
3        Ankle            34              11
4     Pullover            67              11
5         Boot            56               8
6        Ankle            34              14
7       Tshirt            89              23
8        Shirt            45              10

In [100]:
# Let's group the df by product name

df6.groupby('Product Name').mean()

              Order Number  Total Quantity
Product Name
Ankle                 34.0            12.5
Bag                   64.0             9.0
Boot                  56.0             6.5
Pullover              67.0            11.0
Shirt                 45.0            10.0
Tshirt                89.0            23.0

In [101]:
df6.groupby('Product Name').sum()

              Order Number  Total Quantity
Product Name
Ankle                   68              25
Bag                     64               9
Boot                   112              13
Pullover                67              11
Shirt                   90              20
Tshirt                  89              23

In [102]:
df6.groupby('Product Name').min()

              Order Number  Total Quantity
Product Name
Ankle                   34              11
Bag                     64               9
Boot                    56               5
Pullover                67              11
Shirt                   45              10
Tshirt                  89              23

In [103]:
df6.groupby('Product Name').max()

              Order Number  Total Quantity
Product Name
Ankle                   34              14
Bag                     64               9
Boot                    56               8
Pullover                67              11
Shirt                   45              10
Tshirt                  89              23

In [104]:
df6.groupby(['Product Name', 'Order Number']).max()

                           Total Quantity
Product Name Order Number
Ankle        34                        14
Bag          64                         9
Boot         56                         8
Pullover     67                        11
Shirt        45                        10
Tshirt       89                        23

In [105]:
df6.groupby(['Product Name', 'Order Number']).sum()

                           Total Quantity
Product Name Order Number
Ankle        34                        25
Bag          64                         9
Boot         56                        13
Pullover     67                        11
Shirt        45                        20
Tshirt       89                        23

You can also use `aggregation()` after groupby.

In [106]:
df6.groupby('Product Name').aggregate(['min','max','sum'])

             Order Number          Total Quantity
                      min max  sum            min max sum
Product Name
Ankle                  34  34   68             11  14  25
Bag                    64  64   64              9   9   9
Boot                   56  56  112              5   8  13
Pullover               67  67   67             11  11  11
Shirt                  45  45   90             10  10  20
Tshirt                 89  89   89             23  23  23

### H. CrossTab

`Crosstab` compute a simple cross-tabulation of two(or more) factors. By default, computes a frequency table of the factors unless an array of values and an aggregation function are passed.

When you create a crosstab table, you'll need to specify what you want on the `rows`, how to split the `columns`, and what you'd like to include in the `values`

In [107]:
# Let's start with a couple of lists of restaurants

restaurant_names = ['FC', 'LL', 'FC', '5C', 'TS', 'FC', '5C']
purchase_type = ['Food', 'Food', 'Food', 'Drink', 'Food', 'Drink', 'Drink']
price = [12, 25, 32, 10, 15, 22, 18]

print('Restaurant Names: {}'.format(restaurant_names))
print('Purchase Type: {}'.format(purchase_type))
print('Price: {}'.format(price))

Restaurant Names: ['FC', 'LL', 'FC', '5C', 'TS', 'FC', '5C']
Purchase Type: ['Food', 'Food', 'Food', 'Drink', 'Food', 'Drink', 'Drink']
Price: [12, 25, 32, 10, 15, 22, 18]

In [108]:
# Creating a simple crosstab

pd.crosstab(index = restaurant_names, columns=[purchase_type])

col_0  Drink  Food
row_0
5C         2     0
FC         1     2
LL         0     1
TS         0     1


By default(in the example above) crosstab will count the frequencies in which an intersection happens. Notice how '5C' and 'Drink' intersection happens twice, so it's listed as '2' in the values.

But what if we wanted to summarize the price by summing them up? You can do that by passing values and aggfunc.

In [109]:
# simple crosstab with sum aggregate function

pd.crosstab(index=[restaurant_names], columns=[purchase_type], values = price, aggfunc=sum)

col_0  Drink  Food
row_0
5C      28.0   NaN
FC      22.0  44.0
LL       NaN  25.0
TS       NaN  15.0

In [111]:
# Creating a crosstab with numpy array

# creating some data

a = np.array(["foo", "foo", "foo", "foo","bar", "bar", "bar", "bar","foo", "foo", "foo"],dtype=object)

b = np.array(["one", "one", "one", "two","one", "one", "one", "two","two", "two", "one"],dtype=object)

c = np.array(["dull", "dull", "shiny","dull", "dull", "shiny","shiny", "dull", "shiny","shiny", "shiny"],dtype=object)

# form the cross tab
pd.crosstab(index = a, columns = [b, c], rownames=['a'], colnames=['b', 'c'])

b    one        two
c   dull shiny dull shiny
a
bar    1     2    1     0
foo    2     2    1     2

Crosstab comes with many other parameters you can use. Check out the [documentation](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.crosstab.html) for reference.

###  I. Combining Datasets: Concatenating, Joining and Merging

#### Concatenation

In [112]:
# Creating dataframes
#Creating dataframes

df1=pd.DataFrame({'col1':['A','B','C'],
                 'col2':[1,2,3]},
                index=['a','b','c'])

df2=pd.DataFrame({'col1':['D','E','F'],
                 'col2':[4,5,6]},
                index=['d','e','f'])

df3=pd.DataFrame({'col1':['G','I','J'],
                 'col2':[7,8,9]},
                index=['g','i','j'])

In [113]:
df1

  col1  col2
a    A     1
b    B     2
c    C     3

In [114]:
df2

  col1  col2
d    D     4
e    E     5
f    F     6

In [115]:
df3

  col1  col2
g    G     7
i    I     8
j    J     9

In [116]:
# Concatenating: Adding one dataset to another

pd.concat([df1,df2,df3])

  col1  col2
a    A     1
b    B     2
c    C     3
d    D     4
e    E     5
f    F     6
g    G     7
i    I     8
j    J     9

The default axis `0`. This is how the combined dataframes will look like if we change the `axis to 1`

In [117]:
pd.concat([df1,df2,df3], axis=1)

  col1  col2 col1  col2 col1  col2
a    A   1.0  NaN   NaN  NaN   NaN
b    B   2.0  NaN   NaN  NaN   NaN
c    C   3.0  NaN   NaN  NaN   NaN
d  NaN   NaN    D   4.0  NaN   NaN
e  NaN   NaN    E   5.0  NaN   NaN
f  NaN   NaN    F   6.0  NaN   NaN
g  NaN   NaN  NaN   NaN    G   7.0
i  NaN   NaN  NaN   NaN    I   8.0
j  NaN   NaN  NaN   NaN    J   9.0

##### Merging
If you have worked with SQL, what `pd.merge()` does may be familiar. It links data from different sources (different features) and you have a control on the structure of the combined dataset.

Pandas Merge method(`how`): SQL Join Name : Description




* left : LEFT OUTER JOIN : Use keys or columns from left frame only

* right : RIGHT OUTER JOIN : Use keys or columns from right frame only

* outer : FULL OUTER JOIN : Use union of keys or columns from both frames

* inner : INNER JOIN : Use intersection of keys or columns from both frames

In [118]:
df1=pd.DataFrame({'Name':['Joe','Joshua','Jeane', 'David'],
                      'Role':['Manager', 'Developer', 'Engineer', 'Scientist']})

df2=pd.DataFrame({'Name':['David','Joshua','Joe','Jeane' ],
'Year Hired':[2018,2017,2020,2018]})

df3=pd.DataFrame({'Name':[ 'David', 'Joshua', 'Joe', 'Jeane'],
  'No of Leaves':[15,3,10,12]})

In [119]:
df1

     Name       Role
0     Joe    Manager
1  Joshua  Developer
2   Jeane   Engineer
3   David  Scientist

In [120]:
df2

     Name  Year Hired
0   David        2018
1  Joshua        2017
2     Joe        2020
3   Jeane        2018

In [121]:
pd.merge(df1,df2)

     Name       Role  Year Hired
0     Joe    Manager        2020
1  Joshua  Developer        2017
2   Jeane   Engineer        2018
3   David  Scientist        2018

In [122]:
pd.merge(df1,df2,how ='inner', on ='Name')

     Name       Role  Year Hired
0     Joe    Manager        2020
1  Joshua  Developer        2017
2   Jeane   Engineer        2018
3   David  Scientist        2018

# J. Beyond DataFrames: Working with CSV and Excel

In this last section of Pandas`fundamentals` we will see how to read real world data with different formats: CSV and Excel

### CSV and Excel

Let's use california housing dataset.

In [123]:
data = pd.read_csv('housing.csv')

In [124]:
data.head()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY

In [125]:
type(data)

pandas.core.frame.DataFrame

In [126]:
### Exporting dataframe back to csv
data.to_csv('housing_dataset.csv', index=False)

If you look into the folder sidebar, you can see `HOUSING DATASET`

In [127]:
# Exporting CSV to Excel
data.to_excel('housing_dataset.xlsx',index=False)

In [128]:
import os
os.getcwd()

'C:\\Users\\USER\\Desktop\\DATA SCIENCE\\Intro to Panda for Data Computation\\Intro to Panda for Data Computation'

In [131]:
# Exporting the Excel file back
excel_data = pd.read_excel('housing_dataset.xlsx')
excel_data.head()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41,880,129.0,322,126,8.3252,452600,NEAR BAY
1,-122.22,37.86,21,7099,1106.0,2401,1138,8.3014,358500,NEAR BAY
2,-122.24,37.85,52,1467,190.0,496,177,7.2574,352100,NEAR BAY
3,-122.25,37.85,52,1274,235.0,558,219,5.6431,341300,NEAR BAY
4,-122.25,37.85,52,1627,280.0,565,259,3.8462,342200,NEAR BAY

### Real world: Exploaratory Data Analysis(EDA)

All above was the basics. Let us apply some of these techniques to the real world datase, `Red Wine quality`

In [132]:
wine_data=pd.read_csv('winequality-red.csv')

In [133]:
# Displaying the head of the dataset
wine_data.head()

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
0,7.4,0.70,0.00,1.9,0.076,11.0,34.0,0.9978,3.51,0.56,9.4,5
1,7.8,0.88,0.00,2.6,0.098,25.0,67.0,0.9968,3.20,0.68,9.8,5
2,7.8,0.76,0.04,2.3,0.092,15.0,54.0,0.9970,3.26,0.65,9.8,5
3,11.2,0.28,0.56,1.9,0.075,17.0,60.0,0.9980,3.16,0.58,9.8,6
4,7.4,0.70,0.00,1.9,0.076,11.0,34.0,0.9978,3.51,0.56,9.4,5

In [134]:
# Displaying the tail of the dataset

wine_data.tail()

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
1594,6.2,0.600,0.08,2.0,0.090,32.0,44.0,0.99490,3.45,0.58,10.5,5
1595,5.9,0.550,0.10,2.2,0.062,39.0,51.0,0.99512,3.52,0.76,11.2,6
1596,6.3,0.510,0.13,2.3,0.076,29.0,40.0,0.99574,3.42,0.75,11.0,6
1597,5.9,0.645,0.12,2.0,0.075,32.0,44.0,0.99547,3.57,0.71,10.2,5
1598,6.0,0.310,0.47,3.6,0.067,18.0,42.0,0.99549,3.39,0.66,11.0,6

In [141]:
# Displyaing summary statistics

wine_data.describe().T

,count,mean,std,min,25%,50%,75%,max
fixed acidity,1599.0,8.319637,1.741096,4.60000,7.1000,7.90000,9.200000,15.90000
volatile acidity,1599.0,0.527821,0.179060,0.12000,0.3900,0.52000,0.640000,1.58000
citric acid,1599.0,0.270976,0.194801,0.00000,0.0900,0.26000,0.420000,1.00000
residual sugar,1599.0,2.538806,1.409928,0.90000,1.9000,2.20000,2.600000,15.50000
chlorides,1599.0,0.087467,0.047065,0.01200,0.0700,0.07900,0.090000,0.61100
free sulfur dioxide,1599.0,15.874922,10.460157,1.00000,7.0000,14.00000,21.000000,72.00000
total sulfur dioxide,1599.0,46.467792,32.895324,6.00000,22.0000,38.00000,62.000000,289.00000
density,1599.0,0.996747,0.001887,0.99007,0.9956,0.99675,0.997835,1.00369
pH,1599.0,3.311113,0.154386,2.74000,3.2100,3.31000,3.400000,4.01000
sulphates,1599.0,0.658149,0.169507,0.33000,0.5500,0.62000,0.730000,2.00000
alcohol,1599.0,10.422983,1.065668,8.40000,9.5000,10.20000,11.100000,14.90000
quality,1599.0,5.636023,0.807569,3.00000,5.0000,6.00000,6.000000,8.00000

In [142]:
# Displaying quick information about the dataset

wine_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1599 entries, 0 to 1598
Data columns (total 12 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   fixed acidity         1599 non-null   float64
 1   volatile acidity      1599 non-null   float64
 2   citric acid           1599 non-null   float64
 3   residual sugar        1599 non-null   float64
 4   chlorides             1599 non-null   float64
 5   free sulfur dioxide   1599 non-null   float64
 6   total sulfur dioxide  1599 non-null   float64
 7   density               1599 non-null   float64
 8   pH                    1599 non-null   float64
 9   sulphates             1599 non-null   float64
 10  alcohol               1599 non-null   float64
 11  quality               1599 non-null   int64
dtypes: float64(11), int64(1)
memory usage: 150.0 KB

In [144]:
# Checking missing values

wine_data.isnull().sum()

fixed acidity           0
volatile acidity        0
citric acid             0
residual sugar          0
chlorides               0
free sulfur dioxide     0
total sulfur dioxide    0
density                 0
pH                      0
sulphates               0
alcohol                 0
quality                 0
dtype: int64

In [145]:
# wine quality range from 0 to 10. The higher the quality value, the better the wine it is.

wine_data['quality'].value_counts()

5    681
6    638
7    199
4     53
8     18
3     10
Name: quality, dtype: int64

In [146]:
wine_data.groupby(['fixed acidity', 'volatile acidity', 'citric acid']).sum()

                                            residual sugar  chlorides  \
fixed acidity volatile acidity citric acid
4.6           0.520            0.15                    2.1      0.054
4.7           0.600            0.17                    2.3      0.058
4.9           0.420            0.00                    2.1      0.048
5.0           0.380            0.01                    1.6      0.048
              0.400            0.50                    4.3      0.046
...                                                    ...        ...
15.0          0.210            0.44                    4.4      0.150
15.5          0.645            0.49                    8.4      0.190
15.6          0.645            0.49                    4.2      0.095
              0.685            0.76                    3.7      0.100
15.9          0.360            0.65                    7.5      0.096

                                            free sulfur dioxide  \
fixed acidity volatile acidity citric acid
4.6           0.520            0.15                         8.0
4.7           0.600            0.17                        17.0
4.9           0.420            0.00                        16.0
5.0           0.380            0.01                        26.0
              0.400            0.50                        29.0
...                                                         ...
15.0          0.210            0.44                        20.0
15.5          0.645            0.49                        20.0
15.6          0.645            0.49                        10.0
              0.685            0.76                         6.0
15.9          0.360            0.65                        22.0

                                            total sulfur dioxide  density  \
fixed acidity volatile acidity citric acid
4.6           0.520            0.15                         65.0  0.99340
4.7           0.600            0.17                        106.0  0.99320
4.9           0.420            0.00                         42.0  0.99154
5.0           0.380            0.01                         60.0  0.99084
              0.400            0.50                         80.0  0.99020
...                                                          ...      ...
15.0          0.210            0.44                         48.0  2.00010
15.5          0.645            0.49                         46.0  2.00630
15.6          0.645            0.49                         23.0  1.00315
              0.685            0.76                         43.0  1.00320
15.9          0.360            0.65                         71.0  0.99760

                                              pH  sulphates  alcohol  quality
fixed acidity volatile acidity citric acid
4.6           0.520            0.15         3.90       0.56     13.1        4
4.7           0.600            0.17         3.85       0.60     12.9        6
4.9           0.420            0.00         3.71       0.74     14.0        7
5.0           0.380            0.01         3.70       0.75     14.0        6
              0.400            0.50         3.49       0.66     13.6        6
...                                          ...        ...      ...      ...
15.0          0.210            0.44         6.14       1.68     18.4       14
15.5          0.645            0.49         5.84       1.48     22.2       10
15.6          0.645            0.49         2.92       0.74     11.1        5
              0.685            0.76         2.95       0.68     11.2        7
15.9          0.360            0.65         2.98       0.84     14.9        5

[1333 rows x 9 columns]

In [151]:
wine_data.groupby(['free sulfur dioxide','total sulfur dioxide']).sum()

                                          fixed acidity  volatile acidity  \
free sulfur dioxide total sulfur dioxide
1.0                 28.0                           18.2             0.440
                    44.0                            7.9             0.400
2.0                 45.0                            7.9             0.400
3.0                 6.0                            33.0             1.215
                    7.0                            25.8             1.520
...                                                 ...               ...
55.0                95.0                           20.4             1.080
57.0                135.0                           5.9             0.190
66.0                115.0                           6.9             0.630
68.0                124.0                          13.2             1.470
72.0                160.0                           5.9             0.290

                                          citric acid  residual sugar  \
free sulfur dioxide total sulfur dioxide
1.0                 28.0                         0.48             4.2
                    44.0                         0.29             1.8
2.0                 45.0                         0.30             1.8
3.0                 6.0                          1.38             5.0
                    7.0                          0.63             6.0
...                                               ...             ...
55.0                95.0                         0.74            30.8
57.0                135.0                        0.21             1.7
66.0                115.0                        0.33             6.7
68.0                124.0                        0.04            15.8
72.0                160.0                        0.25            13.4

                                          chlorides  density    pH  sulphates  \
free sulfur dioxide total sulfur dioxide
1.0                 28.0                      0.156  1.99800  6.82       1.74
                    44.0                      0.157  0.99730  3.30       0.92
2.0                 45.0                      0.157  0.99727  3.31       0.91
3.0                 6.0                       0.229  2.98892  9.53       1.93
                    7.0                       0.242  2.98210  9.63       1.50
...                                             ...      ...   ...        ...
55.0                95.0                      0.428  2.00738  6.36       1.54
57.0                135.0                     0.045  0.99341  3.32       0.44
66.0                115.0                     0.235  0.99787  3.22       0.56
68.0                124.0                     0.244  1.99880  6.94       1.06
72.0                160.0                     0.067  0.99721  3.33       0.54

                                          alcohol  quality
free sulfur dioxide total sulfur dioxide
1.0                 28.0                     20.6       12
                    44.0                      9.5        6
2.0                 45.0                      9.5        6
3.0                 6.0                      32.7       16
                    7.0                      35.6       18
...                                           ...      ...
55.0                95.0                     18.0       12
57.0                135.0                     9.5        5
66.0                115.0                     9.5        5
68.0                124.0                    19.8       10
72.0                160.0                    10.3        6

[870 rows x 10 columns]

This is the end of the lab  that was about using Panda to manipulate data. Alot of things will make sense when we start to prepare data for machine learning models in the next notebooks.

## Assignment
Consider below Univelcity Bootcamp's information about different batches:

Total_Candidates = {'absolute_beginners': 785, 'beginners': 825, 'intermediate_advanced': 602}
Active_Candidates = {'absolute_beginners': 500, 'beginners': 425, 'intermediate_advanced': 300}
Create a Pandas DataFrame using above information (name your Dataframe as `univelcity`)

Get all the columns in Univelcity.

Get the information of total candidates present in each batches using dictionary-style indexing.

Find the number of candidates for each batches who are not active and add this information to the dataframe `univelcity`.

Also, find the percent of candidates that are active in each batches and add this information to the `univelcity` dataframe

(hint:  =(/)100 )

Get all the batches where percentage of active candidates are greater than 60%

In [252]:
Total_Candidates = {'absolute_beginners': 785, 'beginners': 825, 'intermediate_advanced': 602}
Active_Candidates = {'absolute_beginners': 500, 'beginners': 425, 'intermediate_advanced': 300}

Total_Candidates=pd.Series(Total_Candidates)

Total_Candidates

absolute_beginners       785
beginners                825
intermediate_advanced    602
dtype: int64

In [254]:
Active_Candidates=pd.Series(Active_Candidates)
Active_Candidates

absolute_beginners       500
beginners                425
intermediate_advanced    300
dtype: int64

In [255]:
# Create a Pandas DataFrame using above information (name your Dataframe as `univelcity`)
Levels= {'Levels':['absolute_beginners','beginners', 'intermediate_advanced'],
         'Total_Candidates':[785,825,602],
         'Active_Candidates':[500,425,300]}
univelcity =pd.DataFrame(Levels)
univelcity

                  Levels  Total_Candidates  Active_Candidates
0     absolute_beginners               785                500
1              beginners               825                425
2  intermediate_advanced               602                300

In [256]:
# Get all the columns in Univelcity.
univelcity[['Levels','Total_Candidates','Active_Candidates']]

                  Levels  Total_Candidates  Active_Candidates
0     absolute_beginners               785                500
1              beginners               825                425
2  intermediate_advanced               602                300

In [257]:
univelcity.columns

Index(['Levels', 'Total_Candidates', 'Active_Candidates'], dtype='object')

In [258]:
#Get the information of total candidates present in each batches using dictionary-style indexing
dict(univelcity['Total_Candidates'])

{0: 785, 1: 825, 2: 602}

In [259]:
# Find the number of candidates for each batches who are not active and add this information to the dataframe `univelcity`

Non_Active_Candidates = Total_Candidates - Active_Candidates
Non_Active_Candidates

absolute_beginners       285
beginners                400
intermediate_advanced    302
dtype: int64

In [261]:

univelcity.insert(3,'Non_Active_Candidates',[285,400,302])
univelcity

,Levels,Total_Candidates,Active_Candidates,Non_Active_Candidates
0,absolute_beginners,785,500,285
1,beginners,825,425,400
2,intermediate_advanced,602,300,302

In [265]:
# find the percent of candidates that are active in each batches and add this information to the `univelcity` dataframe
Percentage=(Active_Candidates/Tot_Candidates)*100
Percentage

absolute_beginners       63.694268
beginners                51.515152
intermediate_advanced    49.833887
dtype: float64

In [266]:
univelcity.insert(4,'Percentage',[63.694268, 51.515152,49.833887])
univelcity

,Levels,Total_Candidates,Active_Candidates,Non_Active_Candidates,Percentage
0,absolute_beginners,785,500,285,63.694268
1,beginners,825,425,400,51.515152
2,intermediate_advanced,602,300,302,49.833887

In [277]:
# Get all the batches where percentage of active candidates are greater than 60%
univelcity.loc[:0]

,Levels,Total_Candidates,Active_Candidates,Non_Active_Candidates,Percentage
0,absolute_beginners,785,500,285,63.694268